In [1]:
# Importing all dedicated libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error
import pickle
import pymysql
from sqlalchemy import create_engine
import getpass

In [24]:
pd.set_option('display.max_rows', 100)

In [2]:
password = getpass.getpass()

········

In [3]:
#get the data
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
query = '''SELECT f.title, r.rental_date, c.name, f.rental_rate, r.customer_id
FROM category c
JOIN film_category fc
USING (category_id)
JOIN film f
USING (film_id)
JOIN inventory i
USING (film_id)
JOIN rental r
USING (inventory_id);'''

df = pd.read_sql_query(query, engine)
df.head()

          title         rental_date    name  rental_rate  customer_id
0  AMADEUS HOLY 2005-08-02 01:16:59  Action         0.99           77
1  AMADEUS HOLY 2005-08-18 04:26:54  Action         0.99           39
2  AMADEUS HOLY 2005-06-20 20:35:28  Action         0.99           34
3  AMADEUS HOLY 2005-07-09 05:01:58  Action         0.99          254
4  AMADEUS HOLY 2005-07-30 08:02:39  Action         0.99          276

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [5]:
# shape of the df
df.shape

(16044, 5)

In [6]:
# ordering the data
df= df[['title', 'name', 'rental_rate', 'customer_id', 'rental_date']]

In [7]:
# renaming columns
df.columns= ['title', 'category_name', 'rental_rate', 'customer_id', 'rental_date']

In [8]:
# types of the columns
df.dtypes

title                    object
category_name            object
rental_rate             float64
customer_id               int64
rental_date      datetime64[ns]
dtype: object

In [9]:
# new column for movies that were rented in august of that year
df['rented_aug']= df['rental_date'].dt.month==8

In [10]:
df.head()

,title,category_name,rental_rate,customer_id,rental_date,rented_aug
0,AMADEUS HOLY,Action,0.99,77,2005-08-02 01:16:59,True
1,AMADEUS HOLY,Action,0.99,39,2005-08-18 04:26:54,True
2,AMADEUS HOLY,Action,0.99,34,2005-06-20 20:35:28,False
3,AMADEUS HOLY,Action,0.99,254,2005-07-09 05:01:58,False
4,AMADEUS HOLY,Action,0.99,276,2005-07-30 08:02:39,False

In [11]:
# dropping the cust_id and rental_date col to try without them first 
df.drop(columns= ['customer_id', 'rental_date'], inplace= True)

In [12]:
df.head()

          title category_name  rental_rate  rented_aug
0  AMADEUS HOLY        Action         0.99        True
1  AMADEUS HOLY        Action         0.99        True
2  AMADEUS HOLY        Action         0.99       False
3  AMADEUS HOLY        Action         0.99       False
4  AMADEUS HOLY        Action         0.99       False

In [13]:
# creating a new column for how many times was the movie rented throughout the year
df['times_rented'] = df['title'].map(df['title'].value_counts())

In [14]:
# getting info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 5 columns):
title            16044 non-null object
category_name    16044 non-null object
rental_rate      16044 non-null float64
rented_aug       16044 non-null bool
times_rented     16044 non-null int64
dtypes: bool(1), float64(1), int64(1), object(2)
memory usage: 517.2+ KB

In [15]:
# get uniques
def get_unique(column):
    return df[column].unique()


get_unique('category_name')
get_unique('rental_rate')
get_unique('rented_aug')
get_unique('times_rented')

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

array([0.99, 4.99, 2.99])

array([ True, False])

array([21, 22, 10, 18, 19, 16,  9, 24, 25, 12, 14, 11, 15, 23, 26,  8, 28,
       20, 13, 17, 27, 30,  6,  7, 32, 29,  5, 31,  4, 33, 34])

In [16]:
df.columns

Index(['title', 'category_name', 'rental_rate', 'rented_aug', 'times_rented'], dtype='object')

In [17]:
# re-ordering data
df= df[['title', 'category_name', 'rental_rate', 'times_rented', 'rented_aug']]

In [22]:
df= df.sort_values(by= ['times_rented'])

# ordering data by repeated titles then true false
df= df.sort_values(by= ['title', 'rented_aug'], ascending= [True, False])

# keeping only the unique titles and all true movies rented in august except for those that were never rented in august
df.drop_duplicates(subset= 'title', inplace= True)

df.shape

df['rented_aug'].value_counts()

 ### every movie was rentend in august .... why wouldnt that happen again????